posts/emacs-initel.org
#+BEGIN_COMMENT
.. title: Emacs init.el
.. slug: emacs-initel
.. date: 2024-04-02 13:29:37 UTC-07:00
.. tags: emacs,configuration
.. category: Emacs
.. link: 
.. description: The Emacs configuration file.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2

This is an emacs configuration file. I had this in another repository and have been adding to it over the decades, occasionally removing things when troubleshooting but otherwise it's just a jumble right now, so I'm putting it in the fish-based repository to work on it.

The tangle creates a file ~give-the-fish/dingehaufen/init.el~ that you should copy or link into the right place =~/.emacs.d= right now.

#+begin_notecard
At some post I should look into breaking up the configuration (see https://emacs.stackexchange.com/a/18441 for an example).
#+end_notecard

* Tangle Source
#+BEGIN_SRC emacs-lisp :tangle ../dingehaufen/init.el
<<package-management>>

<<activate-pyvenv>>

<<org-mode>>

;; make sure org-babel comes before jupyter or any other code-based settings
<<org-babel>>

<<org-export-python>>

<<emacs-settings>>

<<emacs-file-locks>>

<<toggle-input-method>>

;; <<python-elpy>>

(custom-set-variables
       ;; custom-set-variables was added by Custom.
       ;; If you edit it by hand, you could mess it up, so be careful.
       ;; Your init file should contain only one such instance.
       ;; If there is more than one, they won't work right.
       '(js-indent-level 2)
       '(js2-basic-offset 2)
       '(js2-bounce-indent-p t)
       '(org-export-backends '(ascii html icalendar latex org))
       '(package-selected-packages
         (quote
          (htmlize ox-nikola ox-rst web-mode swiper smex paredit magit jedi ido-ubiquitous idle-highlight-mode god-mode fuzzy feature-mode csv-mode autopair ac-js2))))

      (custom-set-faces
       ;; custom-set-faces was added by Custom.
       ;; If you edit it by hand, you could mess it up, so be careful.
       ;; Your init file should contain only one such instance.
       ;; If there is more than one, they won't work right.
       '(rst-level-1 ((t (:background "white" :foreground "royal blue"))))
       '(rst-level-2 ((t (:background "white"))))
       '(rst-level-3 ((t (:background "cyan"))))
       '(rst-level-4 ((t (:background "magenta")))))

      ;; rst minor-mode
      (defun turn-on-rst () (rst-minor-mode 1))
      (add-hook 'python-mode-hook 'turn-on-rst)

      ;; hide-show mode
      (defun turn-on-hideshow () (hs-minor-mode 1))
      (add-hook 'python-mode-hook 'turn-on-hideshow)

      ;; make no-tabs universal
      (setq-default indent-tabs-mode nil)

      ;; ipython shell
      (setq python-shell-interpreter "ipython"
            python-shell-interpreter-args "-i")

      <<web-mode>>

      <<auto-complete>>

      (define-global-minor-mode select-electric-pair-mode electric-pair-mode
        (lambda ()
          (when (not (memq major-mode
                           (list 'web-mode 'js2-mode)))
            (electric-pair-mode))))

      (select-electric-pair-mode 1)

      ;; magit
      (setq global-magit-file-mode 1)

      ;; setup the keybinding to launch magit
      (global-set-key (kbd "C-x g") 'magit-status)

      <<tramp-mode>>

      <<tramp-backups>>

<<god-mode>>

<<jupyter-emacs>>

<<general-text>>

<<javascript>>

<<feature-mode>>

<<emacs-gui>>

<<yaml>>

;; <<vue>>

;; <<bats>>

<<backups>>

<<no-sudo-backups>>

;; <<markdown-mode>>

<<dockerfile-mode>>

<<keychain>>

<<hideshow-org>>

;; <<flycheck-mypy>>

<<add-path>>
#+END_SRC
* Package Management
#+NAME: package-management
#+BEGIN_SRC emacs-lisp
  ;; emacs package management
  (require 'package)

  ;; add the repositories
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

  ;; refresh the list
  (when (not package-archive-contents)
    (package-refresh-contents))

  (require 'use-package)
#+END_SRC
* Pyvenv
To prevent errors when emacs starts up and tries to load jupyter (for emacs-jupyter) we need ~jupyter~ to be on the path. Now that debian and ubuntu don't want you to install python packages globally we need another way. I had installed it with [[https://github.com/pypa/pipx][pipx]], which does work, but pipx doesn't doesn't install standalone libraries and sometimes breaks when trying to install dependencies so I think for this case it's better to avoid it and instead use a virtual-environment. Since it has to be activated before anything else that uses python packages, activating the environment should be put fairly early on in the ~init.el~ file.

#+begin_src emacs-lisp :noweb-ref activate-pyvenv
(require 'pyvenv)
(pyvenv-activate "~/.virtualenvs/emacs-environment/")
#+end_src

This assumes that there's a virtual-environment named ~emacs-environment~ setup (with jupyter at least). Note that you could load ~elpy~ instead of just ~pyvenv~ by itself, but ~elpy~ is giving me errors (or at least lots of warnings) when it loads and I don't feel like troubleshooting it right now, since it doesn't play well with org-mode anyway.
* Emacs Settings
#+begin_src emacs-lisp :noweb-ref emacs-settings
;; show column-numbers
(column-number-mode)

;; show matching parentheses
(show-paren-mode 1)
(setq show-paren-delay 0)

;; global parentheses matching (`autopair` package needs to be installed)
(electric-pair-mode 1)

;; turn off auto-fill mode
(remove-hook 'text-mode-hook #'turn-on-auto-fill)

;; hide menu-bar by default
(menu-bar-mode -1)

;; hide the toolbar
(tool-bar-mode -1)

;; disable the scrollbar
(toggle-scroll-bar -1)

(add-to-list 'default-frame-alist '(background-color . "white"))
(add-to-list 'default-frame-alist '(foreground-color . "black"))

;; dark slate blue
;; (add-to-list 'default-frame-alist '(cursor-color . "#483D8B"))
;; dark red
(add-to-list 'default-frame-alist '(cursor-color . "#8B0000"))

;; Disable Bell
(setq ring-bell-function 'ignore)
#+end_src
** File Locks
A lock got corrupted once in the cryfs directory, making the editing file unreadable. You can fix it by copying everything but the corrupted file out, destroying and re-creating the cryfs mount and copying the files back in, but hopefully this will fix it. It does mean that two people could edit the same file and cause problems, but oh, well.

#+begin_src emacs-lisp :noweb-ref emacs-settings
(setq create-lockfiles nil)
#+end_src
** Toggle Input Mode
   This allows you to switch to latex input and then back using =C-\=. This is useful to embed special characters. Although you could probably just do the same thing with math mode if you want to wait until exporting.
#+begin_src emacs-lisp :noweb-ref toggle-input-method
;; (setq default-input-method "TeX")
(setq default-input-method "TeX")
#+end_src
* Tramp Mode
** Use SSH
#+begin_src emacs-lisp :noweb-ref tramp-mode
;; tramp mode
(setq tramp-default-method "ssh")
#+end_src
** No Backups

This is from the [[https://www.gnu.org/software/emacs/manual/html_node/tramp/Auto_002dsave-File-Lock-and-Backup.html][emacs manual]].

