posts/emacs-initel.org
*** Turn Off For Tramp Only

The configuration is currently saving backups to a local directory, so when I use tramp I get warnings about it. It doesn't tell you why but according to the [[https://www.gnu.org/software/emacs/manual/html_node/tramp/Auto_002dsave-File-Lock-and-Backup.html][emacs wiki]] this is a potential security leak (although probably not in the way I'm using it). Anyway, I've never used the backups so I'll just disable them for tramp.

#+begin_src emacs-lisp :noweb-ref tramp-backups
;; disable tramp-backups
(add-to-list 'backup-directory-alist
             (cons tramp-file-name-regexp nil))
#+end_src

#+begin_notecard
**Note:** This turns out to solve the wrong problem so I added another rule in the next section.
#+end_notecard

*** Turn Off For Sudo

Turning off the backups for tramp only fixed one case, but it turned out that the thing that made me look into this was using ~sudo~ on my local machine to opne the ~/etc/hosts~ file so I was actually solving the wrong (or only part of the) problem. This next bit is supposed to turn off all backups where you use ~sudo~. So it probably doesn't belong under tramp any more. Maybe I'll move it later

#+begin_src emacs-lisp :noweb-ref no-sudo-backups
(setq backup-enable-predicate
      (lambda (name)
        (and (normal-backup-enable-predicate name)
             (not
              (let ((method (file-remote-p name 'method)))
                (when (stringp method)
                  (member method '("su" "sudo"))))))))
#+end_src

* God Mode
#+begin_src emacs-lisp :noweb-ref god-mode
;; god-mode
(require 'god-mode)
(global-set-key (kbd "<escape>") 'god-mode-all)
(global-set-key (kbd "C-$") 'god-mode-all)
(global-set-key (kbd "<Scroll_Lock>") 'god-mode-all)
(define-key god-local-mode-map (kbd ".") 'repeat)

(setq god-exempt-major-modes nil)
(setq god-exempt-predicates nil)

(defun my-update-cursor ()
  (setq cursor-type (if (or god-local-mode buffer-read-only)
                        'box
                      'bar)))
(defun c/god-mode-update-cursor ()
  (let ((limited-colors-p (> 257 (length (defined-colors)))))
    (cond (god-local-mode (progn
                            (set-face-background 'mode-line (if limited-colors-p "white" "#e9e2cb"))
                            (set-face-background 'mode-line-inactive (if limited-colors-p "white" "#e9e2cb"))))
          (t (progn
               (set-face-background 'mode-line (if limited-colors-p "black" "#0a2832"))
               (set-face-background 'mode-line-inactive (if limited-colors-p "black" "#0a2832")))))))

(add-hook 'god-mode-enabled-hook 'my-update-cursor)
(add-hook 'god-mode-disabled-hook 'my-update-cursor)

;; window bindings for god-mode
(global-set-key (kbd "C-x C-o") 'other-window)
(global-set-key (kbd "C-x C-1") 'delete-other-windows)
(global-set-key (kbd "C-x C-2") 'split-window-below)
(global-set-key (kbd "C-x C-3") 'split-window-right)
(global-set-key (kbd "C-x C-0") 'delete-window)
(global-set-key (kbd "C-x C-B") 'switch-to-buffer)

;; allow using 's' and 'r' for repeated searches
(require 'god-mode-isearch)
(define-key isearch-mode-map (kbd "<escape>") 'god-mode-isearch-activate)
(define-key god-mode-isearch-map (kbd "<escape>") 'god-mode-isearch-disable)

(define-key god-local-mode-map (kbd ".") 'repeat)
;; set a default virtual environment
(pyvenv-activate "~/.virtualenvs/emacs")

;; hide-show is broken by god mode.
;; this adds universal quick and dirty code-folding that works
(defvar hs-special-modes-alist
  (mapcar 'purecopy
          '((c-mode "{" "}" "/[*/]" nil nil)
            (c++-mode "{" "}" "/[*/]" nil nil)
            (bibtex-mode ("@\\S(*\\(\\s(\\)" 1))
            (java-mode "{" "}" "/[*/]" nil nil)
            (js2-mode "{" "}" "/[*/]" nil))))

(defun toggle-selective-display (column)
  (interactive "P")
  (set-selective-display
   (or column
       (unless selective-display
         (1+ (current-column))))))

(defun toggle-hiding (column)
  (interactive "P")
  (if hs-minor-mode
      (if (condition-case nil
              (hs-toggle-hiding)
            (error t))
          (hs-show-all))
    (toggle-selective-display column)))
(load-library "hideshow")
(global-set-key (kbd "C-+") 'toggle-hiding)
(global-set-key (kbd "C-|") 'toggle-selective-display)
(add-hook 'java-mode-hook       'hs-minor-mode)
(add-hook 'sh-mode-hook         'hs-minor-mode)
(add-hook 'js2-mode-hook         'hs-minor-mode)
#+end_src
* Python and elpy

#+NAME: python-elpy
#+BEGIN_SRC emacs-lisp
  ;; elpy
(use-package elpy
  :ensure t
  :defer t
  :init
  (advice-add 'python-mode :before 'elpy-enable))
  (add-to-list 'auto-mode-alist '("\\.py" . python-mode))
#+END_SRC
* Emacs Jupyter
The ~org-babel-jupyter-override-src-block~ function is loaded by the ~ob-jupyter~ package and sometimes fails if it isn't loaded yet. This only seems to happen while troubleshooting and the init file is being altered, but since it's confusing when it does happen (and a distraction from whatever I'm actually fixing) I'm adding the solution from [[https://github.com/emacs-jupyter/jupyter/issues/461#issuecomment-1678501097][this github bug report]] (the ~with-eval-after-load~ function will wait until the init file is loaded).

#+begin_src emacs-lisp :noweb-ref jupyter-emacs
(with-eval-after-load 'ob-jupyter
  (org-babel-jupyter-override-src-block "python"))
#+end_src
* Fish
#+begin_src emacs-lisp :noweb-ref fish-shell
;; fish functions
'(sh-basic-offset 2)
'(sh-indentation 2)
(setq auto-mode-alist (cons '("\\.fish$" . shell-script-mode) auto-mode-alist))
#+end_src
* Org-mode
  #+BEGIN_SRC emacs-lisp :noweb-ref org-mode
;; org-mode
(require 'org)
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(setq org-log-done t)

;; org-mode agendas
(setq org-agenda-files (list "~/documents/roku-chiji/repository/kanban.org"))

;; org-capture
(setq org-default-notes-file (concat "~/documents/roku-chiji/repository/" "bugs.org"))
(define-key global-map "\C-cc" 'org-capture)

(setq org-capture-templates
      '(("b" "Bug" entry (file+headline "~/documents/roku-chiji/repository/bugs.org" "Bugs")
         "* BUG %?\n  %i\n  %a")))

;; todo-state names
(setq org-todo-keywords
        '((sequence "TOMORROW" "TODAY" "DOING" "|" "DONE")))

;; org clean-outlines

(setq org-startup-indented t
      org-hide-leading-stars t
      org-indent-indentation-per-level 1)

;; word-wrap
(global-visual-line-mode 1)

;; start the calendar on monday
(setq calendar-week-start-day 1)

;; start with outline folded
(setq org-startup-folded t)
  #+END_SRC
* org-export python mode
This just stops emitting the message that emacs is using a default 4 spaces when exporting python.

#+begin_src emacs-lisp :noweb-ref org-export-python
(setq python-indent-guess-indent-offset t)  
(setq python-indent-guess-indent-offset-verbose nil)
#+end_src
* web-mode
  #+NAME: web-mode
  #+BEGIN_SRC emacs-lisp
    ;; web-mode
    (require 'web-mode)
    (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.tmpl\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))

    (defun my-web-mode-hook ()
      "Hooks for Web mode."
      (setq web-mode-markup-indent-offset 2)
      (setq web-mode-css-indent-offset 2)
      (setq web-mode-code-indent-offset 2)
      (setq web-mode-enable-current-column-highlight t)
      (setq web-mode-enable-current-element-highlight t)
      (setq web-mode-engines-alist
          '(("jinja"    . "\\.html\\'"))
          )
    )
    (add-hook 'web-mode-hook  'my-web-mode-hook)
  #+END_SRC

* auto-complete

  #+NAME: auto-complete
  #+BEGIN_SRC emacs-lisp
    ;; auto-complete
    ;; (defun turn-on-autocomplete () (auto-complete-mode 1))
    (add-to-list 'load-path "~/.emacs.d/lisp")
    (require 'auto-complete-config)
    (add-to-list 'ac-dictionary-directories "~/.emacs.d/ac-dict")
    (ac-config-default)
    (defadvice auto-complete-mode (around disable-auto-complete-for-python)
    (unless (eq major-mode 'python-mode) ad-do-it))
  #+END_SRC

* general text
#+NAME: general-text
#+BEGIN_SRC emacs-lisp
  ;; increase/decrease text size
  (global-set-key (kbd "C-c C-+") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease)
#+END_SRC
* javascript
#+NAME: javascript
#+BEGIN_SRC emacs-lisp
;; js2
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
#+END_SRC
* org-babel
#+NAME: org-babel
#+BEGIN_SRC emacs-lisp
  ;; org-babel
(require 'ob-js)

  (add-to-list 'org-src-lang-modes '("rst" . "rst"))
  (add-to-list 'org-src-lang-modes '("feature" . "feature"))
  (add-to-list 'org-src-lang-modes '("org" . "org"))
  (add-to-list 'org-src-lang-modes '("css" . "css"))
  (add-to-list 'org-src-lang-modes '("plantuml" . "plantuml"))
  (add-to-list 'org-src-lang-modes '("conf" . "conf"))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (plantuml . t)
     (shell . t)
     (emacs-lisp . t)
     (latex . t)
     (org . t)
     (js . t)
     (python . t)
     (jupyter . t)
     ))

  (setq org-plantuml-jar-path (expand-file-name "/usr/share/java/plantuml.jar"))
  
  ;; Don't treat underscores as sub-script notation
  (setq org-export-with-sub-superscripts nil)

  ;; Don't re-evaluate the source blocks before exporting
  (setq org-export-babel-evaluate nil)

  ;; don't confirm block evaluation
  (setq org-confirm-babel-evaluate nil)

  ;;; display/update images in the buffer after evaluation
  (add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)

  ;; noweb expansion only when you tangle
  (setq org-babel-default-header-args
        (cons '(:noweb . "tangle")
              (assq-delete-all :noweb org-babel-default-header-args))
        )

  ;; syntax highlighting in org-files
  (setq org-src-fontify-natively t)

  ;; export org to rst
  (require 'ox-rst)

  ;; export org to nikola
  (require 'ox-nikola)

  ;; export to latex/pdf
  (require 'ox-latex)

  ;; syntax-highlighting for pdf's
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-listings 'minted)
  (setq org-latex-pdf-process '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

  ;; let the user set the indentation so you can insert text between methods in classes.
  (setq org-src-preserve-indentation t)

  ;; pygmentize ipython
  (add-to-list 'org-latex-minted-langs '(ipython "python"))
#+END_SRC
* Feature Mode
#+NAME: feature-mode
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.feature" . feature-mode))
#+END_SRC

* yaml
#+BEGIN_SRC emacs-lisp :noweb-ref yaml
(add-hook 'yaml-mode-hook
          (lambda ()
            (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
#+END_SRC
* Vue.js
#+BEGIN_SRC emacs-lisp :noweb-ref vue
;; setup files ending in “.vue” to open in vue-mode
;; (add-to-list 'auto-mode-alist '("\\.vue\\'" . vue-mode))
#+END_SRC
* Bats
  The Bash Automated Test System mode.

| Keybinding | Description                                | State        |
|------------+--------------------------------------------+--------------|
| C-c C-a    | Run all bat-files in the current directory | Works        |
| C-c C-,    | Run all the tests in the current buffer    | Works        |
| C-c M-,    | Run the test where the cursor is           | Doesn't Work |

There's a ticket on github to add this feature (?) to bats, but the old developers stopped supporting it and I don't know if the fork has it yet. It isn't working if you install bats from Ubuntu's repositories as of Bionic Beaver.
#+BEGIN_SRC emacs-lisp :noweb-ref bats
(add-to-list 'auto-mode-alist '("\\.bat\\'" . bats-mode))
#+END_SRC
* Backups
From the [[https://www.emacswiki.org/emacs/BackupDirectory][Emacs Wiki]].
#+BEGIN_SRC emacs-lisp :noweb-ref backups
(setq backup-directory-alist 
      '(("." . "/tmp/")))
(setq auto-save-file-name-transforms
      `((".*" , "/tmp/" t)))
#+END_SRC
