posts/emacs-initel.org
* Markdown Mode
#+BEGIN_SRC emacs-lisp :noweb-ref markdown-mode
(use-package markdown-mode
 :ensure t
 :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
 :init (setq markdown-command "pandoc")
)

#+END_SRC
* Dockerfile Mode
#+begin_src emacs-lisp :noweb-ref dockerfile-mode
(require 'dockerfile-mode)
(add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode))
#+end_src
* Flycheck
#+begin_src emacs-lisp :noweb-ref flycheck-mypy
;; flycheck
(use-package flycheck
  :ensure t
  :config
  (global-flycheck-mode t)
  ;; note that these bindings are optional
  (global-set-key (kbd "C-c n") 'flycheck-next-error)
  ;; this might override a default binding for running a python process,
  ;; see comments below this answer
  (global-set-key (kbd "C-c p") 'flycheck-prev-error)
  )
;; flycheck-pycheckers
;; Allows multiple syntax checkers to run in parallel on Python code
;; Ideal use-case: pyflakes for syntax combined with mypy for typing
(use-package flycheck-pycheckers
  :after flycheck
  :ensure t
  :init
  (with-eval-after-load 'flycheck
    (add-hook 'flycheck-mode-hook #'flycheck-pycheckers-setup)
    )
  (setq flycheck-pycheckers-checkers
    '(
      mypy3
      pyflakes
      )
    )
  )
;; elpy
(use-package elpy
  :after poetry
  :ensure t
  :config
  (elpy-enable)
  (add-hook 'elpy-mode-hook 'poetry-tracking-mode) ;; optional if you're using Poetry
  (setq elpy-rpc-virtualenv-path 'current)
  (setq elpy-syntax-check-command "~/.virtualenvs/neurotic-networks/bin/pyflakes") ;; or replace with the path to your pyflakes binary
  ;; allows Elpy to see virtualenv
  (add-hook 'elpy-mode-hook
        ;; pyvenv-mode
        '(lambda ()
           (pyvenv-mode +1)
           )
        )
  ;; use flycheck instead of flymake
  (when (load "flycheck" t t)
  (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
  (add-hook 'elpy-mode-hook 'flycheck-mode))
  )
;; poetry
(use-package poetry
  :ensure t)
#+end_src  
* Keychain
This is to be able to use ssh-agent (via keychain).
- `keychain` needs to be installed (e.g. via apt)
- It needs to be running - Add this to the fish.config

#+begin_src fish
if status --is-interactive
 keychain --eval --quiet -Q id_rsa | source
end
#+end_src

#+begin_src elisp :noweb-ref keychain
(require 'keychain-environment)
(keychain-refresh-environment)
#+end_src
* Hideshow-Org
#+begin_src elisp :noweb-ref hideshow-org
(add-to-list 'load-path "~/projects/third-party/hideshow-org/")
(require 'hideshow-org)
#+end_src
